---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.GetUnitsName(System.Int32)
source: html/241d2c20-a9eb-2d58-eac0-39861795901d.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.GetUnitsName Method

returns units name by index

## Syntax (C#)
```csharp
public string GetUnitsName(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - index of unit in the list